<a href="https://colab.research.google.com/github/gagankpatra/data-science-notebooks/blob/master/Loading_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

The first step in any machine learning endeavor is to get the raw data into our system. 

The raw data might be a logfile, dataset file, or database. Furthermore, often we will want to retrieve data from multiple source

# Loading a CSV File

In [29]:
#Upload files (not folder)<30MB from local machine

from google.colab import files
uploaded = files.upload() # then browse, select the files. It's then uploaded

Saving data-text.xlsx to data-text.xlsx

In [32]:
!ls sample_data

anscombe.json		      data-text.csv   data-text.xml	     README.md
california_housing_test.csv   data-text.json  mnist_test.csv
california_housing_train.csv  data-text.xlsx  mnist_train_small.csv

/Solution/ - using  csv  library.

The csv library we are importing comes with your Python installation as part of the standard library (or stdlib).

In [0]:
# Load library
import csv

csvfile = open('sample_data/data-text.csv', 'r')
reader = csv.reader(csvfile)

for row in enumerate(reader):
    print (row)

we optionally specify which mode this file should be opened in (we used 'rb'). 

If you visit the docs for the open function, you will find that the argument 'rb' means that we open the file as read-only and in binary mode. 

Opening the file in binary mode allows our code to run on both Windows and Unix-based operating systems. 

The other common mode is write ('w', or 'wb' for write in binary mode).

If you want to read, open in read mode. If you intend to write, open the file in write mode.

In [0]:
# When you run the file again after saving it, each record will be a dictionary. The keys in the dictionary come from the first row of the CSV file. All the subsequent rows are values.
import csv

csvfile = open('sample_data/data-text.csv', 'r')
reader = csv.DictReader(csvfile)

for row in reader:
    print (row)

/Solution/ - Use the pandas library’s read_csv to load a local or hosted CSV file. read_csv has over 30 parameters

http://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html#pandas.read_csv

In [25]:
# Load library
import pandas as pd

# Load dataset
dataframe = pd.read_csv('sample_data/data-text.csv')

# View first two rows
dataframe.head(5)

,Indicator,PUBLISH STATES,Year,WHO region,World Bank income group,Country,Sex,Display Value,Numeric,Low,High,Comments
0,Life expectancy at birth (years),Published,1990,Europe,High-income,Andorra,Both sexes,77,77.0,NaN,NaN,NaN
1,Life expectancy at birth (years),Published,2000,Europe,High-income,Andorra,Both sexes,80,80.0,NaN,NaN,NaN
2,Life expectancy at age 60 (years),Published,2012,Europe,High-income,Andorra,Female,28,28.0,NaN,NaN,NaN
3,Life expectancy at age 60 (years),Published,2000,Europe,High-income,Andorra,Both sexes,23,23.0,NaN,NaN,NaN
4,Life expectancy at birth (years),Published,2012,Eastern Mediterranean,High-income,United Arab Emirates,Female,78,78.0,NaN,NaN,NaN

In [4]:
# Load library
import pandas as pd

# Create URL
url = 'http://bit.ly/imdbratings'

# Load dataset
dataframe = pd.read_csv(url)

# View first two rows
dataframe.head(5)

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

# Loading an Excel File

/Problem/ - You need to import an Excel spreadsheet.

/Solution/ - Use the pandas library’s read_excel to load an Excel spreadsheet

http://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html#pandas.read_excel

In [108]:
# Load library
import pandas as pd

# Create URL
url = 'sample_data/data-text.xlsx'

# Load data
dataframe = pd.read_excel(url, sheet_name=0, header=0)

# View the first five rows
dataframe.head(5)

,Indicator,PUBLISH STATES,Year,WHO region,World Bank income group,Country,Sex,Display Value,Numeric,Low,High,Comments
0,Life expectancy at birth (years),Published,1990,Europe,High-income,Andorra,Both sexes,77,77,NaN,NaN,NaN
1,Life expectancy at birth (years),Published,2000,Europe,High-income,Andorra,Both sexes,80,80,NaN,NaN,NaN
2,Life expectancy at age 60 (years),Published,2012,Europe,High-income,Andorra,Female,28,28,NaN,NaN,NaN
3,Life expectancy at age 60 (years),Published,2000,Europe,High-income,Andorra,Both sexes,23,23,NaN,NaN,NaN
4,Life expectancy at birth (years),Published,2012,Eastern Mediterranean,High-income,United Arab Emirates,Female,78,78,NaN,NaN,NaN

Selecting subset of columns

In [0]:
df = pd.DataFrame(pd.read_excel(url, sheet_name=0, header=0), columns= ['Country'])
print (df)

# Loading a JSON File

/Solution/ - using  json  library.

In [0]:
# Load library
import json

# Read dataset
json_data = open('sample_data/data-text.json').read()

# Load dataset
data = json.loads(json_data)

for item in data:
    print (item)

/Solution/ - The pandas library provides read_json to convert a JSON file into a pandas object

In [43]:
# Load library
import pandas as pd

# Load data
dataframe = pd.read_json('sample_data/data-text.json', orient='columns')

# View the first five rows
dataframe.head(5)

,Comments,Country,Display Value,High,Indicator,Low,Numeric,PUBLISH STATES,Sex,WHO region,World Bank income group,Year
0,,Andorra,77,,Life expectancy at birth (years),,77,Published,Both sexes,Europe,High-income,1990
1,,Andorra,80,,Life expectancy at birth (years),,80,Published,Both sexes,Europe,High-income,2000
2,,Andorra,28,,Life expectancy at age 60 (years),,28,Published,Female,Europe,High-income,2012
3,,Andorra,23,,Life expectancy at age 60 (years),,23,Published,Both sexes,Europe,High-income,2000
4,,United Arab Emirates,78,,Life expectancy at birth (years),,78,Published,Female,Eastern Mediterranean,High-income,2012

Normalize semi-structured JSON data into a flat table.

pandas.io.json.json_normalize(data, record_path=None, meta=None, meta_prefix=None, record_prefix=None, errors='raise', sep='.')

In [44]:
from pandas.io.json import json_normalize

data = [{'id': 1, 'name': {'first': 'Coleen', 'last': 'Volk'}},{'name': {'given': 'Mose', 'family': 'Regner'}},{'id': 2, 'name': 'Faye Raker'}]

json_normalize(data)

    id        name name.family name.first name.given name.last
0  1.0         NaN         NaN     Coleen        NaN      Volk
1  NaN         NaN      Regner        NaN       Mose       NaN
2  2.0  Faye Raker         NaN        NaN        NaN       NaN

# Loading a XML  File

/Solution/ - using  xml.etree library.

In [105]:
import pandas as pd
from xml.etree import ElementTree as ET

tree = ET.parse('sample_data/data-text.xml')
root = tree.getroot()
data = root.find('Data')

all_data = []

for observation in data:
    record = {}
    for item in observation:
        lookup_key = list(item.attrib.keys())[0]
        
        if lookup_key == 'Numeric':
            rec_key = 'NUMERIC'
            rec_value = item.attrib['Numeric']
        else:
            rec_key = item.attrib[lookup_key]
            rec_value = item.attrib['Code']

        record[rec_key] = rec_value
        
    all_data.append(record)

# Load data
dataframe = pd.DataFrame(all_data)

# View the first five rows
dataframe.head(5)

,COUNTRY,GHO,NUMERIC,PUBLISHSTATE,REGION,SEX,WORLDBANKINCOMEGROUP,YEAR
0,AND,WHOSIS_000001,77.00000,PUBLISHED,EUR,BTSX,WB_HI,1990
1,AND,WHOSIS_000001,80.00000,PUBLISHED,EUR,BTSX,WB_HI,2000
2,AND,WHOSIS_000015,28.00000,PUBLISHED,EUR,FMLE,WB_HI,2012
3,AND,WHOSIS_000015,23.00000,PUBLISHED,EUR,BTSX,WB_HI,2000
4,ARE,WHOSIS_000001,78.00000,PUBLISHED,EMR,FMLE,WB_HI,2012

# Querying a SQL Database

/Problem/ - You need to load data from a database using the structured query language (SQL).

/Solution/ -  pandas’ read_sql_query allows us to make a SQL query to a database and load it

In [0]:
# Load libraries
import pandas as pd
from sqlalchemy import create_engine

# Create a connection to the database
database_connection = create_engine('sqlite:///sample.db')

# Load data
dataframe = pd.read_sql_query('SELECT * FROM data', database_connection)

# View first five rows
dataframe.head(5)

# Connect Python to SQL Server using pyodbc

In [0]:
!pip install pyodbc

In [0]:
import pyodbc 
conn = pyodbc.connect('Driver={SQL Server};'
                      'Server=server_name;'
                      'Database=db_name;'
                      'Trusted_Connection=yes;')

cursor = conn.cursor()
cursor.execute('SELECT * FROM db_name.Table')

for row in cursor:
    print(row)

# Connect Python to Oracle

Step 1: Install the cx_Oracle package
 
Step 2: Retrieve the connection information. You can do that by locating your tnsnames.ora file on your computer (e.g., type tnsnames.ora in the Windows search bar)

Step 3: check for Host Name, Port Number and  Service Name
                
SYSTEM_OCON =
(DESCRIPTION =
(ADDRESS = (PROTOCOL = TCP)(HOST = Host Name)(PORT = Port Number))
(LOAD_BALANCE = YES)
(CONNECT_DATA =
(SERVER = DEDICATED)
(SERVICE_NAME = Service Name)
(FAILOVER_MODE =
(TYPE = SELECT)
(METHOD = BASIC)
(RETRIES = 180)
(DELAY = 5)

In [0]:
!python -m pip install cx_Oracle --upgrade

In [0]:
import cx_Oracle

dsn_tns = cx_Oracle.makedsn('Host Name', 'Port Number', service_name='Service Name') #if needed, place an 'r' before any parameter in order to address any special character such as '\'.

conn = cx_Oracle.connect(user=r'User Name', password='Personal Password', dsn=dsn_tns) #if needed, place an 'r' before any parameter in order to address any special character such as '\'. For example, if your user name contains '\', you'll need to place 'r' before the user name: user=r'User Name'

cursor = conn.cursor()

cursor.execute(
'''select
client_id,
client_first_name,
client_last_name,
units_ordered,
product_price_per_unit,
product_name,
((units_ordered) * (product_price_per_unit)) AS revenue
from tracking_sales''')
 
for row in cursor.fetchall():
    print (row)
       
cursor.execute(
'''select
sum(((units_ordered) * (product_price_per_unit))) AS total_revenue
from tracking_sales''')
    
for row in cursor.fetchall():
    print (row)
    
cursor.execute(
'''select
ts.client_id,
ts.client_first_name,
ts.client_last_name,
ts.units_ordered,
ts.product_price_per_unit,
ts.product_name,
((ts.units_ordered) * (ts.product_price_per_unit)) AS revenue,
sc.country
from tracking_sales ts
left join shipping_country sc on ts.client_id = sc.client_id 
''')
     
for row in cursor.fetchall():
    print (row)